//OZA265   JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=AREARPT
//STEPLIB  DD DSN=OZA265.TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CUSTKSDS DD DSN=OZA265.HARMAN.KSDS.FILE,DISP=SHR
//METERKSDS DD DSN=OZA265.TRGA5.METER.KSDS,DISP=SHR
//READTXN  DD DSN=OZA265.TRGA5.READING.TXN,DISP=SHR
//REPORTDD DD SYSOUT=*
