//OZA265   JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=BILLPAY
//STEPLIB  DD DSN=OZA265.TRGA5.COBOL.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BILLKSDS DD DSN=OZA265.TRGA5.BILL.KSDS,DISP=SHR
//PAYMENT  DD DSN=OZA265.TRGA5.PAYMENT.DATA,DISP=SHR
//BILLUPD  DD DSN=OZA265.TRGA5.BILL.UPDATED,DISP=SHR
//PAYRPT   DD SYSOUT=*
